module.exports = {
	'GREETINGS': 'Hola amigo👋\n\n' +
		'Я - Binary авто-тест 🤖. Готовий отримати фідбек про свою роботу?\n\n' +
    'Хочу зазначити, що я оцінюю тільки функціонал, за який ти можеш отримати максимум ${total} балів.\n' +
		'Код перегляне розробник із байнарі, але тільки за умови, що твоя робота буде бомбезною 💣💥',
	'GO_THROUGH_THE_LIST': 'Давай пройдемось по пунктах 📔',
	'RESULT_PERFECT': 'Чудово! Всі тести пройдено 🎉. Так тримати!\n\nТвій поточний бал: ${score}/${total}🦜',
	'RESULT_GOOD': 'Непогана робота 👍. Але деякий функціонал зламався. Якщо в тебе ще залишилися спроби, то було б добре виправити помилки 🛠️\n\nТвій поточний бал: ${score}/${total}🦜',
	'RESULT_BAD': 'Можна було б краще 🤷. Якщо в тебе залишились спроби, то виправ помилки. Я вірю в тебе 🙏\n\nТвій поточний бал: ${score}/${total}🦜',
	'RESULT_WORST': 'Здається суттєва частка функціоналу перестала працювати як треба.\n' +
		'Проте може буте й таке, що я не зміг отримати доступ до репозиторію. Перевір чи коректно вказаний лінк: https://github.com/[твій нікнейм]/homepage\n' +
		'Також перевір, чи є публічний доступ до репозиторія.\n' +
		'Якщо і це не допомогло, то напиши до служби підтримки.',

  'UNIT_TEST': 'Unit tests',
  'UNIT_TEST_1': 'Unit test #1 should be passed',
  'UNIT_TEST_2': 'Unit test #2 should be passed',
  'UNIT_TEST_3': 'Unit test #3 should be passed',
  'UNIT_TEST_4': 'Unit test #4 should be passed',
  'UNIT_TEST_5': 'Unit test #5 should be passed',
  'UNIT_TEST_6': 'Unit test #6 should be passed',
  'UNIT_TEST_7': 'Unit test #7 should be passed',
  'UNIT_TEST_8': 'Unit test #8 should be passed',
  'UNIT_TEST_9': 'Unit test #9 should be passed',
  'UNIT_TEST_10': 'Unit test #10 should be passed',
  'UNIT_TEST_11': 'Unit test #11 should be passed',

  'INTEGRATION_TEST': 'Integration Test',
  'HAS_INTEGRATION_TEST': 'Integration test should not be empty',

  'TOTAL_TESTS_AMOUNT': 'Total number of tests',
  'HAS_PROPER_AMOUNT_OF_TESTS': 'The total amount should not exceed 12'
};
