module.exports = {
	'GREETINGS': 'Hola amigo👋\n\n' +
		'Я - Binary авто-тест 🤖. Готовий отримати фідбек про свою роботу?\n\n' +
    'Хочу зазначити, що я оцінюю тільки функціонал, за який ти можеш отримати максимум ${total} балів.\n' +
		'Код перегляне розробник із байнарі, але тільки за умови, що твоя робота буде бомбезною 💣💥',
	'GO_THROUGH_THE_LIST': 'Давай пройдемось по пунктах 📔',
	'RESULT_PERFECT': 'Чудово! Всі тести пройдено 🎉. Так тримати!\n\nТвій поточний бал: ${score}/${total}🦜',
	'RESULT_GOOD': 'Непогана робота 👍. Але деякий функціонал зламався. Якщо в тебе ще залишилися спроби, то було б добре виправити помилки 🛠️\n\nТвій поточний бал: ${score}/${total}🦜',
	'RESULT_BAD': 'Можна було б краще 🤷. Якщо в тебе залишились спроби, то виправ помилки. Я вірю в тебе 🙏\n\nТвій поточний бал: ${score}/${total}🦜',
	'RESULT_WORST': 'Здається суттєва частка функціоналу перестала працювати як треба.\n' +
		'Проте може буте й таке, що я не зміг отримати доступ до репозиторію. Перевір чи коректно вказаний лінк: https://github.com/[твій нікнейм]/homepage\n' +
		'Також перевір, чи є публічний доступ до репозиторія.\n' +
		'Якщо і це не допомогло, то напиши до служби підтримки.',

  'UNIT_TESTS': 'Юніт тести',
  'UNIT_TEST_1': 'Юніт тест #1 повинен бути успішним',
  'UNIT_TEST_2': 'Юніт тест #2 повинен бути успішним',
  'UNIT_TEST_3': 'Юніт тест #3 повинен бути успішним',
  'UNIT_TEST_4': 'Юніт тест #4 повинен бути успішним',
  'UNIT_TEST_5': 'Юніт тест #5 повинен бути успішним',
  'UNIT_TEST_6': 'Юніт тест #6 повинен бути успішним',
  'UNIT_TEST_7': 'Юніт тест #7 повинен бути успішним',
  'UNIT_TEST_8': 'Юніт тест #8 повинен бути успішним',
  'UNIT_TEST_9': 'Юніт тест #9 повинен бути успішним',
  'UNIT_TEST_10': 'Юніт тест #10 повинен бути успішним',
  'UNIT_TEST_11': 'Юніт тест #11 повинен бути успішним',

  'INTEGRATION_TEST': 'Інтеграційний тест',
  'HAS_INTEGRATION_TEST': 'Інтеграційний тест повинен бути присутнім',

  'TOTAL_TESTS_AMOUNT': 'Загальна кількість тестів',
  'HAS_PROPER_AMOUNT_OF_TESTS': 'Загальна сума не повинна бути перевищувати 12'
};
